==========
Annotate variable
==========
@annotation def x = 5
---

(program
  (local_variable_declaration
    (modifiers
      (marker_annotation
        name: (identifier)))
    declarator: (variable_declarator
      name: (identifier)
      value: (decimal_integer_literal))))

==========
Annotate function
==========
@annotation(withArgs)
def f() {
}
---

(program
  (function_definition
    (modifiers
      (annotation
        name: (identifier)
        arguments: (annotation_argument_list
          (identifier))))
    name: (identifier)
    parameters: (formal_parameters)
    body: (closure)))

==========
Annotate class
==========
@annotation(withArgs)
static class f {
}
---

(program
  (class_declaration
    (modifiers
      (annotation
        name: (identifier)
        arguments: (annotation_argument_list
          (identifier))))
    name: (identifier)
    body: (class_body)))

==========
Create annotation
==========
private @interface annotation {
}
---

(program
  (annotation_type_declaration
    (modifiers)
    name: (identifier)
    body: (annotation_type_body)))

==========
Multiple annotations
==========
@annotation(withArgs)
@annotation2
static class f {
}
---

(program
  (class_declaration
    (modifiers
      (annotation
        name: (identifier)
        arguments: (annotation_argument_list
          (identifier)))
      (marker_annotation
        name: (identifier)))
    name: (identifier)
    body: (class_body)))
